PX4/PX4-Autopilot/nuttx/arch/arm/src/kinetis/kinetis_uart.h
/* UART Baud Rate Register Low.  Bits 0-7 of the UART baud rate bits. */

/* UART Control Register 1 */

#define UART_C1_PT                   (1 << 0)  /* Bit 0: Parity Type */
#define UART_C1_PE                   (1 << 1)  /* Bit 1: Parity Enable */
#define UART_C1_ILT                  (1 << 2)  /* Bit 2: Idle Line Type Select */
#define UART_C1_WAKE                 (1 << 3)  /* Bit 3: Receiver Wakeup Method Select */
#define UART_C1_M                    (1 << 4)  /* Bit 4: 9-bit or 8-bit Mode Select */
#define UART_C1_RSRC                 (1 << 5)  /* Bit 5: Receiver Source Select */
#define UART_C1_UARTSWAI             (1 << 6)  /* Bit 6: UART Stops in Wait Mode */
#define UART_C1_LOOPS                (1 << 7)  /* Bit 7: Loop Mode Select */

/* UART Control Register 2 */

#define UART_C2_SBK                  (1 << 0)  /* Bit 0: Send Break */
#define UART_C2_RWU                  (1 << 1)  /* Bit 1: Receiver Wakeup Control */
#define UART_C2_RE                   (1 << 2)  /* Bit 2: Receiver Enable */
#define UART_C2_TE                   (1 << 3)  /* Bit 3: Transmitter Enable */
#define UART_C2_ILIE                 (1 << 4)  /* Bit 4: Idle Line Interruptor Enable */
#define UART_C2_RIE                  (1 << 5)  /* Bit 5: Receiver Full Interrupt or DMA Transfer Enable */
#define UART_C2_TCIE                 (1 << 6)  /* Bit 6: Transmission Complete Interrupt Enable */
#define UART_C2_TIE                  (1 << 7)  /* Bit 7: Transmitter Interrupt or DMA Transfer Enable */
#define UART_C2_ALLINTS              (0xf0)

/* UART Status Register 1 */

#define UART_S1_PF                   (1 << 0)  /* Bit 0: Parity Error Flag */
#define UART_S1_FE                   (1 << 1)  /* Bit 1: Framing Error Flag */
#define UART_S1_NF                   (1 << 2)  /* Bit 2: Noise Flag */
#define UART_S1_OR                   (1 << 3)  /* Bit 3: Receiver Overrun Flag */
#define UART_S1_IDLE                 (1 << 4)  /* Bit 4: Idle Line Flag */
#define UART_S1_RDRF                 (1 << 5)  /* Bit 5: Receive Data Register Full Flag */
#define UART_S1_TC                   (1 << 6)  /* Bit 6: Transmit Complete Flag */
#define UART_S1_TDRE                 (1 << 7)  /* Bit 7: Transmit Data Register Empty Flag */

/* UART Status Register 2 */

#define UART_S2_RAF                  (1 << 0)  /* Bit 0: Receiver Active Flag */
#define UART_S2_LBKDE                (1 << 1)  /* Bit 1: LIN Break Detection Enable */
#define UART_S2_BRK13                (1 << 2)  /* Bit 2: Break Transmit Character Length */
#define UART_S2_RWUID                (1 << 3)  /* Bit 3: Receive Wakeup Idle Detect */
#define UART_S2_RXINV                (1 << 4)  /* Bit 4: Receive Data Inversion */
#define UART_S2_MSBF                 (1 << 5)  /* Bit 5: Most Significant Bit First */
#define UART_S2_RXEDGIF              (1 << 6)  /* Bit 6: RxD Pin Active Edge Interrupt Flag */
#define UART_S2_LBKDIF               (1 << 7)  /* Bit 7: LIN Break Detect Interrupt Flag */

/* UART Control Register 3 */

#define UART_C3_PEIE                 (1 << 0)  /* Bit 0: Parity Error Interrupt Enable */
#define UART_C3_FEIE                 (1 << 1)  /* Bit 1: Framing Error Interrupt Enable */
#define UART_C3_NEIE                 (1 << 2)  /* Bit 2: Noise Error Interrupt Enable */
#define UART_C3_ORIE                 (1 << 3)  /* Bit 3: Overrun Error Interrupt Enable */
#define UART_C3_TXINV                (1 << 4)  /* Bit 4: Transmit Data Inversion */
#define UART_C3_TXDIR                (1 << 5)  /* Bit 5: Transmitter Pin Data Direction in Single-Wire mode */
#define UART_C3_T8                   (1 << 6)  /* Bit 6: Transmit Bit 8 */
#define UART_C3_R8                   (1 << 7)  /* Bit 7: Received Bit 8 */

/* UART Data Register: 8-bit data register. */
/* UART Match Address Registers 1 & 2: 8-bit address registers */

/* UART Control Register 4 */

#define UART_C4_BRFA_SHIFT           (0)       /* Bits 0-4: Baud Rate Fine Adjust */
#define UART_C4_BRFA_MASK            (31 << UART_C4_BRFA_SHIFT)
#define UART_C4_M10                  (1 << 5)  /* Bit 5: 10-bit Mode select */
#define UART_C4_MAEN2                (1 << 6)  /* Bit 6: Match Address Mode Enable 2 */
#define UART_C4_MAEN1                (1 << 7)  /* Bit 7: Match Address Mode Enable 1 */

/* UART Control Register 5 */

                                               /* Bit 0-4: Reserved */
#define UART_C5_RDMAS                (1 << 5)  /* Bit 5: Receiver Full DMA Select */
                                               /* Bit 6: Reserved */
#define UART_C5_TDMAS                (1 << 7)  /* Bit 7: Transmitter DMA Select */

/* UART Extended Data Register */

                                               /* Bit 0-5: Reserved */
#define UART_ED_PARITYE              (1 << 6)  /* Bit 6: The current received dataword contained
                                                *        in D and C3[R8] was received with a parity error */
#define UART_ED_NOISY                (1 << 7)  /* Bit 7: The current received dataword contained
                                                *        in D and C3[R8] was received with noise */

/* UART Modem Register */

#define UART_MODEM_TXCTSE            (1 << 0)  /* Bit 0: Transmitter clear-to-send enable */
#define UART_MODEM_TXRTSE            (1 << 1)  /* Bit 1: Transmitter request-to-send enable */
#define UART_MODEM_TXRTSPOL          (1 << 2)  /* Bit 2: Transmitter request-to-send polarity */
#define UART_MODEM_RXRTSE            (1 << 3)  /* Bit 3: Receiver request-to-send enable */
                                               /* Bits 4-7: Reserved */

/* UART Infrared Register */

#define UART_IR_TNP_SHIFT            (0)       /* Bits 0-1: Transmitter narrow pulse */
#define UART_IR_TNP_MASK             (3 << UART_IR_TNP_SHIFT)
#  define UART_IR_TNP_316THS         (0 << UART_IR_TNP_SHIFT) /* 3/16 */
#  define UART_IR_TNP_16TH           (1 << UART_IR_TNP_SHIFT) /* 1/16 */
#  define UART_IR_TNP_32ND           (2 << UART_IR_TNP_SHIFT) /* 1/32 */
#  define UART_IR_TNP_4TH            (3 << UART_IR_TNP_SHIFT) /* 1/4 */
#define UART_IR_IREN                 (1 << 2)  /* Bit 2: Infrared enable */
                                               /* Bits 3-7: Reserved */

/* UART FIFO Parameters */

#define UART_PFIFO_RXFIFOSIZE_SHIFT  (0)       /* Bits 0-2: Receive FIFO. Buffer Depth */
#define UART_PFIFO_RXFIFOSIZE_MASK   (7 << UART_PFIFO_RXFIFOSIZE_SHIFT)
#  define UART_PFIFO_RXFIFOSIZE_1    (0 << UART_PFIFO_RXFIFOSIZE_SHIFT) /* 1 */
#  define UART_PFIFO_RXFIFOSIZE_4    (1 << UART_PFIFO_RXFIFOSIZE_SHIFT) /* 4 */
#  define UART_PFIFO_RXFIFOSIZE_8    (2 << UART_PFIFO_RXFIFOSIZE_SHIFT) /* 8 */
#  define UART_PFIFO_RXFIFOSIZE_16   (3 << UART_PFIFO_RXFIFOSIZE_SHIFT) /* 16 */
#  define UART_PFIFO_RXFIFOSIZE_32   (4 << UART_PFIFO_RXFIFOSIZE_SHIFT) /* 32 */
#  define UART_PFIFO_RXFIFOSIZE_64   (5 << UART_PFIFO_RXFIFOSIZE_SHIFT) /* 64 */
#  define UART_PFIFO_RXFIFOSIZE_128  (6 << UART_PFIFO_RXFIFOSIZE_SHIFT) /* 128 */
#define UART_PFIFO_RXFE              (1 << 3)  /* Bit 3: Receive FIFO Enable */
#define UART_PFIFO_TXFIFOSIZE_SHIFT  (4)       /* Bits 4-6: Transmit FIFO. Buffer Depth */
#define UART_PFIFO_TXFIFOSIZE_MASK   (7 << UART_PFIFO_TXFIFOSIZE_SHIFT)
#  define UART_PFIFO_TXFIFOSIZE_1    (0 << UART_PFIFO_TXFIFOSIZE_SHIFT) /* 1 */
#  define UART_PFIFO_TXFIFOSIZE_4    (1 << UART_PFIFO_TXFIFOSIZE_SHIFT) /* 4 */
#  define UART_PFIFO_TXFIFOSIZE_8    (2 << UART_PFIFO_TXFIFOSIZE_SHIFT) /* 8 */
#  define UART_PFIFO_TXFIFOSIZE_16   (3 << UART_PFIFO_TXFIFOSIZE_SHIFT) /* 16 */
#  define UART_PFIFO_TXFIFOSIZE_32   (4 << UART_PFIFO_TXFIFOSIZE_SHIFT) /* 32 */
#  define UART_PFIFO_TXFIFOSIZE_64   (5 << UART_PFIFO_TXFIFOSIZE_SHIFT) /* 64 */
#  define UART_PFIFO_TXFIFOSIZE_128  (6 << UART_PFIFO_TXFIFOSIZE_SHIFT) /* 128 */
#define UART_PFIFO_TXFE              (1 << 7)  /* Bit 7: Transmit FIFO Enable */

/* UART FIFO Control Register */

#define UART_CFIFO_RXUFE             (1 << 0)  /* Bit 0: Receive FIFO Underflow Interrupt Enable */
#define UART_CFIFO_TXOFE             (1 << 1)  /* Bit 1: Transmit FIFO Overflow Interrupt Enable */
                                               /* Bits 2-5: Reserved */
#define UART_CFIFO_RXFLUSH           (1 << 6)  /* Bit 6: Receive FIFO/Buffer Flush */
#define UART_CFIFO_TXFLUSH           (1 << 7)  /* Bit 7: Transmit FIFO/Buffer Flush */

/* UART FIFO Status Register */

