PX4/PX4-Autopilot/nuttx/arch/arm/src/kinetis/kinetis_uart.h
#define UART_SFIFO_RXUF              (1 << 0)  /* Bit 0: Receiver Buffer Underflow Flag */
#define UART_SFIFO_TXOF              (1 << 1)  /* Bit 1: Transmitter Buffer Overflow Flag */
                                               /* Bits 2-5: Reserved */
#define UART_SFIFO_RXEMPT            (1 << 6)  /* Bit 6: Receive Buffer/FIFO Empty */
#define UART_SFIFO_TXEMPT            (1 << 7)  /* Bit 7: Transmit Buffer/FIFO Empty */

/* UART FIFO Transmit Watermark.  8-bit watermark value. */
/* UART FIFO Transmit Count. 8-bit count value */
/* UART FIFO Receive Watermark.  8-bit watermark value. */
/* UART FIFO Receive Count. 8-bit count value */

/* UART 7816 Control Register */

#define UART_C7816_ISO7816E          (1 << 0)  /* Bit 0: ISO-7816 Functionality Enabled */
#define UART_C7816_TTYPE             (1 << 1)  /* Bit 1: Transfer Type */
#define UART_C7816_INIT              (1 << 2)  /* Bit 2: Detect Initial Character */
#define UART_C7816_ANACK             (1 << 3)  /* Bit 3: Generate NACK on Error */
#define UART_C7816_ONACK             (1 << 4)  /* Bit 4: Generate NACK on Overflow */
                                               /* Bits 5-7: Reserved */

/* UART 7816 Interrupt Enable Register */

#define UART_IE7816_RXTE             (1 << 0)  /* Bit 0: Receive Threshold Exceeded Interrupt Enable */
#define UART_IE7816_TXTE             (1 << 1)  /* Bit 1: Transmit Threshold Exceeded Interrupt Enable */
#define UART_IE7816_GTVE             (1 << 2)  /* Bit 2: Guard Timer Violated Interrupt Enable */
                                               /* Bit 3: Reserved */
#define UART_IE7816_INITDE           (1 << 4)  /* Bit 4: Initial Character Detected Interrupt Enable */
#define UART_IE7816_BWTE             (1 << 5)  /* Bit 5: Block Wait Timer Interrupt Enable */
#define UART_IE7816_CWTE             (1 << 6)  /* Bit 6: Character Wait Timer Interrupt Enable */
#define UART_IE7816_WTE              (1 << 7)  /* Bit 7: Wait Timer Interrupt Enable */

/* UART 7816 Interrupt Status Register */

#define UART_IS7816_RXT              (1 << 0)  /* Bit 0: Receive Threshold Exceeded Interrupt */
#define UART_IS7816_TXT              (1 << 1)  /* Bit 1: Transmit Threshold Exceeded Interrupt */
#define UART_IS7816_GTV              (1 << 2)  /* Bit 2: Guard Timer Violated Interrupt */
                                               /* Bit 3: Reserved */
#define UART_IS7816_INITD            (1 << 4)  /* Bit 4: Initial Character Detected Interrupt */
#define UART_IS7816_BWT              (1 << 5)  /* Bit 5: Block Wait Timer Interrupt */
#define UART_IS7816_CWT              (1 << 6)  /* Bit 6: Character Wait Timer Interrupt */
#define UART_IS7816_WT               (1 << 7)  /* Bit 7: Wait Timer Interrupt */

/* UART 7816 Wait Parameter Register.  8-bit Wait Timer Interrupt value. */

/* UART 7816 Wait Parameter Register */

#define UART_WP7816T1_BWI_SHIFT      (0)       /* Bit 0-3: Block Wait Time Integer(C7816[TTYPE] = 1) */
#define UART_WP7816T1_BWI_MASK       (15 << UART_WP7816T1_BWI_SHIFT)
#define UART_WP7816T1_CWI_SHIFT      (4)       /* Bits 4-7: Character Wait Time Integer (C7816[TTYPE] = 1) */
#define UART_WP7816T1_CWI_MASK       (15 << UART_WP7816T1_CWI_SHIFT)

/* UART 7816 Wait N Register.  8-bit Guard Band value. */
/* UART 7816 Wait FD Register. 8-bit FD Multiplier value. */

/* UART 7816 Error Threshold Register */

#define UART_ET7816_RXTHRESH_SHIFT   (0)       /* Bit 0-3: Receive NACK Threshold */
#define UART_ET7816_RXTHRESH_MASK    (15 << UART_ET7816_RXTHRESHOLD_SHIFT)
#define UART_ET7816_TXTHRESH_SHIFT   (4)       /* Bits 4-7: Transmit NACK Threshold */
#define UART_ET7816_TXTHRESH_MASK    (15 << UART_ET7816_TXTHRESHOLD_MASK)

/* UART 7816 Transmit Length Register. 8-bit Transmit Length value */

/************************************************************************************
 * Public Types
 ************************************************************************************/

/************************************************************************************
 * Public Data
 ************************************************************************************/

/************************************************************************************
 * Public Functions
 ************************************************************************************/

#endif /* __ARCH_ARM_SRC_KINETIS_KINETIS_UART_H */
